
### Terragrunt diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]
azurerm_public_ip.ip-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-jumpbox]
azurerm_public_ip.ip-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_virtual_network.vnet-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev]
azurerm_ssh_public_key.ssh-pub-key: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/sshPublicKeys/global-ssh-key]
azurerm_network_security_group.nsg-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox]
azurerm_nat_gateway.ng-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev]
azurerm_network_security_rule.nsg-jumpbox-allow-ssh: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInboundSSH]
azurerm_network_security_rule.ngs-jumpbox-allow-443: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound443]
azurerm_network_security_rule.ngs-jumpbox-allow-80: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox/securityRules/AllowAnyInbound80]
azurerm_subnet.subnet-pub-dev-01: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_subnet_network_security_group_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_subnet_nat_gateway_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_interface.nif-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox]
azurerm_network_interface_security_group_association.assoc-nif-sg-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-jumpbox]
azurerm_linux_virtual_machine.jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/virtualMachines/jumpbox]
cloudflare_record.jumpbox-dns: Refreshing state... [id=9f917e8b972a7d90b56c7b9df4c6aa75]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_private_dns_zone.phz will be created
  + resource "azurerm_private_dns_zone" "phz" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "servrfarm.tech"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg"

      + soa_record (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
